import random
words_bank = ['computer', ' python', ' java', 'c++', 'c', 'linux','mac', 'windows','github']
word = random.choice(words_bank)
joon=7
user_true_chars = []
while True:
    for char in word:
        if char in user_true_chars:
            print(char, end = ' ')
        else:
            print('_', end=' ')
    user_char= input ('\n please enter a character:')
    if user_char in word:
        user_true_chars.append(user_char)
        print('++')
    else : 
        joon -=1
        print('x')
    if joon == 0:
        print ('game over')
        break
        

توضیحات کدم :یک کلمه که تعداد کاراکتر هاشو میدونیم باید حدس بزنیم هر کاراکتر که درست حدس بزنیم سرجاش 
قرار میگیره.و اگر اشتباه حدس بزنیم ادم میمیره. قبل هر چیز باید یک بانک کلماتی داشته باشیم تا کلماتی 
 رو به طور رندوم برای کاربر بیاره. باید از کاربر یک کاراکتر دریافت کنیم و چک کنیم که اون کاراکتر داخل رشته هست یانه
 تعداد تکرار مشخص نیس پس از وایل استفاده میکنیم.در خط 13 میگیم که اگر کاراکتر کاربر درست وارد شده و تو کلمه ما
 وجود داره چاپ کن مثلا دوتا مثبت
 جون هم همان جان ادم ماست همان کاربر که با هر حدس اشتباه یک جونشو از دست میده من خودم جونش رو مثلا 7 
 گذاشتم و در خط 17 نشون دادم که مثلا با حدس اشتباه یک جون از دست داده در خط 14 هم گفتم که 
 با حدس درست حرف کاراکتره سرجاش قرار میگیره که اول براش یک لیست تعریف کردم به نام ترو کارز در خط5
 یعنی کاراکترایی که کاربره درست حدس زده
 و براهمین نوشتم اپند که یعنی اگر کاراکتر کاربر درست حدس زده شد ان را به لیست کاراکتر های درست اضافه کن 
 دستور این هم که خودتون گفتین برای بررسی اینکه یک عضوی تو یک مجموعه هست یا نه استفاده میشه
